Диплом/src/Documents/ПеремещениеТоваровМатериалов/ПеремещениеТоваровМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваровМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеМатериала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Материалов</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериалов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Товаров</name>
      <type>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/AccumulationRegisters/ОстаткиМатериаловИТоваров/ОстаткиМатериаловИТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериаловИТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
      <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      <types>CatalogRef.ЛесСырьё_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/Documents/ПеремещениеТоваровМатериалов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	
	#Область ТабТовары
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериаловТовары.Номенклатура_Товаров,
	|	СУММА(ПеремещениеТоваровМатериаловТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов.ТоварыДляПеремещения КАК ПеремещениеТоваровМатериаловТовары
	|ГДЕ
	|	ПеремещениеТоваровМатериаловТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровМатериаловТовары.Номенклатура_Товаров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.Номенклатура_Товаров,
	|	ДокТЧ.Количество
	|ИЗ
	|	ДокТЧ КАК ДокТЧ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Товаров;
		Движение.Помещение = Отправитель;
		Движение.Количество = Выборка.Количество;	
	КонецЦикла;
	
	Движения.Записать();
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Отправитель И Номенклатура В (Выбрать ДокТЧ.Номенклатура_Товаров ИЗ ДокТЧ КАК ДокТЧ)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	РезультатЗапроса = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало товара "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыДляПеремещения Из ТоварыДляПеремещения Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТоварыДляПеремещения.Номенклатура_Товаров;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаТоварыДляПеремещения.Количество;
	КонецЦикла;
	#КонецОбласти

#Область ТабМатериалы 
 Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Номенклатура_Материалов,
	|	СУММА(ПеремещениеТоваровМатериаловМатериалыДляПеремещения.КоличествоМатериалов) КАК КоличествоМатериалов
	|ПОМЕСТИТЬ ТЧМат
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов.МатериалыДляПеремещения КАК ПеремещениеТоваровМатериаловМатериалыДляПеремещения
	|ГДЕ
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Номенклатура_Материалов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧМат.Номенклатура_Материалов,
	|	ТЧМат.КоличествоМатериалов
	|ИЗ
	|	ТЧМат КАК ТЧМат";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Материалов;
		Движение.Помещение = Отправитель;
		Движение.Количество = Выборка.КоличествоМатериалов;
		
	КонецЦикла;
	
	Движения.Записать();
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Отправитель И Номенклатура В (Выбрать ТЧМат.Номенклатура_Материалов ИЗ ТЧМат КАК ТЧМат)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	РезультатЗапроса = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало материалов "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалыДляПеремещения Из МатериалыДляПеремещения Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалыДляПеремещения.Номенклатура_Материалов;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаМатериалыДляПеремещения.КоличествоМатериалов;
	КонецЦикла;



#КонецОбласти
	
	
	
КонецПроцедуры
